# ElevTextPos Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ElevTextPos Property
ParameterTypeId Class See Also
---
"Text Position"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ElevTextPos { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElevTextPos As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ElevTextPos {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace